app/controllers/users_controller.rb

UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$10$CAkY6nbFDyvO8EcaUyR9HOtQl/Y1oAPUzI80XIICtjhjPiLL3ejga"], ["updated_at", "2016-03-13 08:41:33.817474"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)